10) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/DependencyInjection/ConsoleUiExtension.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     /** @param array<mixed> $mergedConfig */
     public function loadInternal(array $mergedConfig, ContainerBuilder $container) : void
     {
-        $this->configureStartConsoleCommand($container);
+        
         $this->configureControllers($container);
         $this->configureCommandProcessor($container);
         $this->configureCommandHandler($container);

29) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/DependencyInjection/ConsoleUiExtension.php:116    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     private function configureStartConsoleCommand(ContainerBuilder $containerBuilder) : void
     {
-        $containerBuilder->register(StartConsoleUiCommand::class, StartConsoleUiCommand::class)->addArgument('%kernel.project_dir%')->addTag('console.command');
+        
     }
 }

2) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:28    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     }
     protected function configure() : void
     {
-        $this->setName('_ui')->setDescription('Start Console UI Application')->addArgument('console_environment', InputArgument::OPTIONAL, 'Select between "local" or "docker" environments', 'local');
+        
     }
     protected function execute(InputInterface $input, OutputInterface $output) : int
     {

3) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:42    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     protected function execute(InputInterface $input, OutputInterface $output) : int
     {
         $environment = $input->getArgument('console_environment');
-        /** @psalm-suppress RedundantCondition */
-        Assert::string($environment);
+        
         if ('local' === $environment) {
             try {
                 $this->runMercureLocal();

4) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:44    [M] Identical

--- Original
+++ New
@@ @@
         $environment = $input->getArgument('console_environment');
         /** @psalm-suppress RedundantCondition */
         Assert::string($environment);
-        if ('local' === $environment) {
+        if ('local' !== $environment) {
             try {
                 $this->runMercureLocal();
                 $this->runQueue();

5) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:46    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         Assert::string($environment);
         if ('local' === $environment) {
             try {
-                $this->runMercureLocal();
+                
                 $this->runQueue();
                 $this->runWebServer();
                 $this->runElectronApp();

6) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:47    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         if ('local' === $environment) {
             try {
                 $this->runMercureLocal();
-                $this->runQueue();
+                
                 $this->runWebServer();
                 $this->runElectronApp();
                 while (count($this->activeProcesses)) {

7) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:48    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             try {
                 $this->runMercureLocal();
                 $this->runQueue();
-                $this->runWebServer();
+                
                 $this->runElectronApp();
                 while (count($this->activeProcesses)) {
                     foreach ($this->activeProcesses as $index => $runningProcess) {

8) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:49    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $this->runMercureLocal();
                 $this->runQueue();
                 $this->runWebServer();
-                $this->runElectronApp();
+                
                 while (count($this->activeProcesses)) {
                     foreach ($this->activeProcesses as $index => $runningProcess) {
                         // specific process is finished, so we remove it

9) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:51    [M] While_

--- Original
+++ New
@@ @@
                 $this->runQueue();
                 $this->runWebServer();
                 $this->runElectronApp();
-                while (count($this->activeProcesses)) {
+                while (false) {
                     foreach ($this->activeProcesses as $index => $runningProcess) {
                         // specific process is finished, so we remove it
                         if (!$runningProcess->isRunning()) {

10) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:52    [M] Foreach_

--- Original
+++ New
@@ @@
                 $this->runWebServer();
                 $this->runElectronApp();
                 while (count($this->activeProcesses)) {
-                    foreach ($this->activeProcesses as $index => $runningProcess) {
+                    foreach (array() as $index => $runningProcess) {
                         // specific process is finished, so we remove it
                         if (!$runningProcess->isRunning()) {
                             unset($this->activeProcesses[$index]);

11) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:54    [M] LogicalNot

--- Original
+++ New
@@ @@
                 while (count($this->activeProcesses)) {
                     foreach ($this->activeProcesses as $index => $runningProcess) {
                         // specific process is finished, so we remove it
-                        if (!$runningProcess->isRunning()) {
+                        if ($runningProcess->isRunning()) {
                             unset($this->activeProcesses[$index]);
                             if (!$runningProcess->isSuccessful()) {
                                 throw new ProcessFailedException($runningProcess);

12) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:56    [M] LogicalNot

--- Original
+++ New
@@ @@
                         // specific process is finished, so we remove it
                         if (!$runningProcess->isRunning()) {
                             unset($this->activeProcesses[$index]);
-                            if (!$runningProcess->isSuccessful()) {
+                            if ($runningProcess->isSuccessful()) {
                                 throw new ProcessFailedException($runningProcess);
                             }
                         }

13) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:57    [M] Throw_

--- Original
+++ New
@@ @@
                         if (!$runningProcess->isRunning()) {
                             unset($this->activeProcesses[$index]);
                             if (!$runningProcess->isSuccessful()) {
-                                throw new ProcessFailedException($runningProcess);
+                                new ProcessFailedException($runningProcess);
                             }
                         }
                         $output->write($runningProcess->getIncrementalOutput());

14) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:61    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                                 throw new ProcessFailedException($runningProcess);
                             }
                         }
-                        $output->write($runningProcess->getIncrementalOutput());
+                        
                         // check every second
                         sleep(1);
                     }

15) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:63    [M] DecrementInteger

--- Original
+++ New
@@ @@
                         }
                         $output->write($runningProcess->getIncrementalOutput());
                         // check every second
-                        sleep(1);
+                        sleep(0);
                     }
                 }
             } catch (ProcessFailedException $exception) {

16) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:63    [M] IncrementInteger

--- Original
+++ New
@@ @@
                         }
                         $output->write($runningProcess->getIncrementalOutput());
                         // check every second
-                        sleep(1);
+                        sleep(2);
                     }
                 }
             } catch (ProcessFailedException $exception) {

17) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:63    [M] FunctionCallRemoval

--- Original
+++ New
@@ @@
                             }
                         }
                         $output->write($runningProcess->getIncrementalOutput());
-                        // check every second
-                        sleep(1);
+                        
                     }
                 }
             } catch (ProcessFailedException $exception) {

18) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:68    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 }
             } catch (ProcessFailedException $exception) {
                 $process = $exception->getProcess();
-                Assert::isInstanceOf($process, Process::class);
+                
                 foreach ($this->activeProcesses as $activeProcess) {
                     $activeProcess->signal(SIGKILL);
                 }

19) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:69    [M] Foreach_

--- Original
+++ New
@@ @@
             } catch (ProcessFailedException $exception) {
                 $process = $exception->getProcess();
                 Assert::isInstanceOf($process, Process::class);
-                foreach ($this->activeProcesses as $activeProcess) {
+                foreach (array() as $activeProcess) {
                     $activeProcess->signal(SIGKILL);
                 }
                 $output->writeln(sprintf('<error>%s%s</error>', $process->getIncrementalOutput(), $process->getErrorOutput()));

20) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 $process = $exception->getProcess();
                 Assert::isInstanceOf($process, Process::class);
                 foreach ($this->activeProcesses as $activeProcess) {
-                    $activeProcess->signal(SIGKILL);
+                    
                 }
                 $output->writeln(sprintf('<error>%s%s</error>', $process->getIncrementalOutput(), $process->getErrorOutput()));
             }

21) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:72    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 foreach ($this->activeProcesses as $activeProcess) {
                     $activeProcess->signal(SIGKILL);
                 }
-                $output->writeln(sprintf('<error>%s%s</error>', $process->getIncrementalOutput(), $process->getErrorOutput()));
+                
             }
             return Command::SUCCESS;
         }

22) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:82    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             }
             return Command::SUCCESS;
         }
-        $output->writeln(sprintf('<error>Given console environment "%s" is not implemented</error>', $environment));
+        
         return Command::FAILURE;
     }
     private function runMercureLocal() : void

23) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:92    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private function runMercureLocal() : void
     {
-        $process = new Process(['./mercure'], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 1, 'CORS_ALLOWED_ORIGINS' => '*']);
+        $process = new Process([], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 1, 'CORS_ALLOWED_ORIGINS' => '*']);
         $process->setTimeout(0);
         $process->setPty(true);
         $process->start();

24) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:92    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private function runMercureLocal() : void
     {
-        $process = new Process(['./mercure'], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 1, 'CORS_ALLOWED_ORIGINS' => '*']);
+        $process = new Process(['./mercure'], $this->projectDir, ['ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 1, 'CORS_ALLOWED_ORIGINS' => '*']);
         $process->setTimeout(0);
         $process->setPty(true);
         $process->start();

25) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:95    [M] DecrementInteger

--- Original
+++ New
@@ @@
     }
     private function runMercureLocal() : void
     {
-        $process = new Process(['./mercure'], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 1, 'CORS_ALLOWED_ORIGINS' => '*']);
+        $process = new Process(['./mercure'], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 0, 'CORS_ALLOWED_ORIGINS' => '*']);
         $process->setTimeout(0);
         $process->setPty(true);
         $process->start();

26) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:95    [M] IncrementInteger

--- Original
+++ New
@@ @@
     }
     private function runMercureLocal() : void
     {
-        $process = new Process(['./mercure'], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 1, 'CORS_ALLOWED_ORIGINS' => '*']);
+        $process = new Process(['./mercure'], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 2, 'CORS_ALLOWED_ORIGINS' => '*']);
         $process->setTimeout(0);
         $process->setPty(true);
         $process->start();

27) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:98    [M] DecrementInteger

--- Original
+++ New
@@ @@
     private function runMercureLocal() : void
     {
         $process = new Process(['./mercure'], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 1, 'CORS_ALLOWED_ORIGINS' => '*']);
-        $process->setTimeout(0);
+        $process->setTimeout(-1);
         $process->setPty(true);
         $process->start();
         $this->activeProcesses[] = $process;

28) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:98    [M] IncrementInteger

--- Original
+++ New
@@ @@
     private function runMercureLocal() : void
     {
         $process = new Process(['./mercure'], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 1, 'CORS_ALLOWED_ORIGINS' => '*']);
-        $process->setTimeout(0);
+        $process->setTimeout(1);
         $process->setPty(true);
         $process->start();
         $this->activeProcesses[] = $process;

29) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:98    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function runMercureLocal() : void
     {
         $process = new Process(['./mercure'], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 1, 'CORS_ALLOWED_ORIGINS' => '*']);
-        $process->setTimeout(0);
+        
         $process->setPty(true);
         $process->start();
         $this->activeProcesses[] = $process;

30) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:99    [M] TrueValue

--- Original
+++ New
@@ @@
     {
         $process = new Process(['./mercure'], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 1, 'CORS_ALLOWED_ORIGINS' => '*']);
         $process->setTimeout(0);
-        $process->setPty(true);
+        $process->setPty(false);
         $process->start();
         $this->activeProcesses[] = $process;
     }

31) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:99    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $process = new Process(['./mercure'], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 1, 'CORS_ALLOWED_ORIGINS' => '*']);
         $process->setTimeout(0);
-        $process->setPty(true);
+        
         $process->start();
         $this->activeProcesses[] = $process;
     }

32) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:101    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $process = new Process(['./mercure'], $this->projectDir, ['JWT_KEY' => $_SERVER['MERCURE_JWT_SECRET'], 'ADDR' => $_SERVER['MERCURE_HOST'], 'ALLOW_ANONYMOUS' => 1, 'CORS_ALLOWED_ORIGINS' => '*']);
         $process->setTimeout(0);
         $process->setPty(true);
-        $process->start();
+        
         $this->activeProcesses[] = $process;
     }
     private function runQueue() : void

33) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:108    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private function runQueue() : void
     {
-        $process = new Process(['bin/console', 'enqueue:consume', '--client=console_queue', '-vvv'], $this->projectDir);
+        $process = new Process(['enqueue:consume', '--client=console_queue', '-vvv'], $this->projectDir);
         $process->setTimeout(0);
         $process->setPty(true);
         $process->start();

34) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:109    [M] DecrementInteger

--- Original
+++ New
@@ @@
     private function runQueue() : void
     {
         $process = new Process(['bin/console', 'enqueue:consume', '--client=console_queue', '-vvv'], $this->projectDir);
-        $process->setTimeout(0);
+        $process->setTimeout(-1);
         $process->setPty(true);
         $process->start();
         $this->activeProcesses[] = $process;

35) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:109    [M] IncrementInteger

--- Original
+++ New
@@ @@
     private function runQueue() : void
     {
         $process = new Process(['bin/console', 'enqueue:consume', '--client=console_queue', '-vvv'], $this->projectDir);
-        $process->setTimeout(0);
+        $process->setTimeout(1);
         $process->setPty(true);
         $process->start();
         $this->activeProcesses[] = $process;

36) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:109    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function runQueue() : void
     {
         $process = new Process(['bin/console', 'enqueue:consume', '--client=console_queue', '-vvv'], $this->projectDir);
-        $process->setTimeout(0);
+        
         $process->setPty(true);
         $process->start();
         $this->activeProcesses[] = $process;

40) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:119    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private function runWebServer() : void
     {
-        $process = new Process(['php', '-S', 'localhost:3000', '-t', 'public'], $this->projectDir);
+        $process = new Process(['-S', 'localhost:3000', '-t', 'public'], $this->projectDir);
         $process->setTimeout(0);
         $process->setPty(true);
         $process->start();

41) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:120    [M] DecrementInteger

--- Original
+++ New
@@ @@
     private function runWebServer() : void
     {
         $process = new Process(['php', '-S', 'localhost:3000', '-t', 'public'], $this->projectDir);
-        $process->setTimeout(0);
+        $process->setTimeout(-1);
         $process->setPty(true);
         $process->start();
         $this->activeProcesses[] = $process;

42) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:120    [M] IncrementInteger

--- Original
+++ New
@@ @@
     private function runWebServer() : void
     {
         $process = new Process(['php', '-S', 'localhost:3000', '-t', 'public'], $this->projectDir);
-        $process->setTimeout(0);
+        $process->setTimeout(1);
         $process->setPty(true);
         $process->start();
         $this->activeProcesses[] = $process;

43) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:120    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function runWebServer() : void
     {
         $process = new Process(['php', '-S', 'localhost:3000', '-t', 'public'], $this->projectDir);
-        $process->setTimeout(0);
+        
         $process->setPty(true);
         $process->start();
         $this->activeProcesses[] = $process;

47) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:130    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private function runElectronApp() : void
     {
-        $process = new Process(['npm', 'run', 'console-ui-start'], $this->projectDir);
+        $process = new Process(['run', 'console-ui-start'], $this->projectDir);
         $process->setTimeout(0);
         $process->setPty(true);
         $process->start();

48) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:131    [M] DecrementInteger

--- Original
+++ New
@@ @@
     private function runElectronApp() : void
     {
         $process = new Process(['npm', 'run', 'console-ui-start'], $this->projectDir);
-        $process->setTimeout(0);
+        $process->setTimeout(-1);
         $process->setPty(true);
         $process->start();
         $this->activeProcesses[] = $process;
     }
 }

49) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:131    [M] IncrementInteger

--- Original
+++ New
@@ @@
     private function runElectronApp() : void
     {
         $process = new Process(['npm', 'run', 'console-ui-start'], $this->projectDir);
-        $process->setTimeout(0);
+        $process->setTimeout(1);
         $process->setPty(true);
         $process->start();
         $this->activeProcesses[] = $process;
     }
 }

50) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/Command/StartConsoleUiCommand.php:131    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private function runElectronApp() : void
     {
         $process = new Process(['npm', 'run', 'console-ui-start'], $this->projectDir);
-        $process->setTimeout(0);
+        
         $process->setPty(true);
         $process->start();
         $this->activeProcesses[] = $process;
     }
 }

54) /home/kpicaza/server/test-symfony-console/app/packages/console-ui-bundle/src/ConsoleUiBundle.php:26    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     private const DEFAULT_CONFIG = ['command_provider' => 'enqueue_php', 'provider_options' => ['enqueue_php' => ['queue_name' => 'console_queue']]];
     public function build(ContainerBuilder $container) : void
     {
-        $container->loadFromExtension('console_ui', self::DEFAULT_CONFIG);
+        
         $container->prependExtensionConfig('enqueue', ['console_queue' => ['transport' => ['dsn' => '%env(CONSOLE_QUEUE_DSN)%'], 'client' => ['app_name' => 'console_ui%kernel.environment%', 'traceable_producer' => true]]]);
         $container->addCompilerPass(new ConsoleUiCompilerPass());
     }
 }
