5) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/DependencyInjection/ConsoleUiCompilerPass.php:34    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $provider = $mergedConfig['command_provider'];
         Assert::string($provider);
         if ($provider === 'enqueue-php') {
-            Assert::keyExists($mergedConfig, 'provider_options');
+            
             Assert::isArray($mergedConfig['provider_options']);
             $providerOptions = $mergedConfig['provider_options'];
             Assert::keyExists($providerOptions, 'queue_name');

6) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/DependencyInjection/ConsoleUiCompilerPass.php:37    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             Assert::keyExists($mergedConfig, 'provider_options');
             Assert::isArray($mergedConfig['provider_options']);
             $providerOptions = $mergedConfig['provider_options'];
-            Assert::keyExists($providerOptions, 'queue_name');
+            
             Assert::string($providerOptions['queue_name']);
             $queueName = $providerOptions['queue_name'];
             $container->register(CommandSchedulerInterface::class, EnqueueCommandScheduler::class)->addArgument(new Reference(sprintf('enqueue.client.%s.lazy_producer', $queueName)));


Timed Out mutants:
==================

2) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/ConsoleUiBundle.php:23    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     public function build(ContainerBuilder $container) : void
     {
         $container->loadFromExtension('console_ui', self::DEFAULT_CONFIG);
-        $container->addCompilerPass(new ConsoleUiCompilerPass());
+        
     }
 }

10) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Controller/CommandScheduleController.php:35    [M] DecrementInteger

--- Original
+++ New
@@ @@
         } catch (JsonException $exception) {
             throw new BadRequestException('Invalid Json Request Given', 0, $exception);
         } catch (InvalidArgumentException $exception) {
-            throw new BadRequestException($exception->getMessage(), 0, $exception);
+            throw new BadRequestException($exception->getMessage(), -1, $exception);
         }
         $command = new QueuedCommand($parsedBody['name'], $parsedBody['arguments'], $parsedBody['options']);
         $this->handler->handle($command);

11) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Controller/CommandScheduleController.php:35    [M] IncrementInteger

--- Original
+++ New
@@ @@
         } catch (JsonException $exception) {
             throw new BadRequestException('Invalid Json Request Given', 0, $exception);
         } catch (InvalidArgumentException $exception) {
-            throw new BadRequestException($exception->getMessage(), 0, $exception);
+            throw new BadRequestException($exception->getMessage(), 1, $exception);
         }
         $command = new QueuedCommand($parsedBody['name'], $parsedBody['arguments'], $parsedBody['options']);
         $this->handler->handle($command);

12) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Controller/CommandScheduleController.php:35    [M] Throw_

--- Original
+++ New
@@ @@
         } catch (JsonException $exception) {
             throw new BadRequestException('Invalid Json Request Given', 0, $exception);
         } catch (InvalidArgumentException $exception) {
-            throw new BadRequestException($exception->getMessage(), 0, $exception);
+            new BadRequestException($exception->getMessage(), 0, $exception);
         }
         $command = new QueuedCommand($parsedBody['name'], $parsedBody['arguments'], $parsedBody['options']);
         $this->handler->handle($command);

13) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/DependencyInjection/Configuration.php:25    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $treeBuilder = new TreeBuilder('console_ui');
         $rootNode = $treeBuilder->getRootNode();
-        /**
-         * @psalm-suppress PossiblyNullReference
-         * @psalm-suppress PossiblyUndefinedMethod
-         * @psalm-suppress MixedMethodCall
-         */
-        $rootNode->children()->enumNode('command_provider')->values(['enqueue-php'])->end()->arrayNode('provider_options')->scalarPrototype()->end()->end()->scalarNode('queue_name')->defaultValue('default_queue')->end()->end();
+        
         return $treeBuilder;
     }
 }

14) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/DependencyInjection/Configuration.php:27    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
          * @psalm-suppress PossiblyUndefinedMethod
          * @psalm-suppress MixedMethodCall
          */
-        $rootNode->children()->enumNode('command_provider')->values(['enqueue-php'])->end()->arrayNode('provider_options')->scalarPrototype()->end()->end()->scalarNode('queue_name')->defaultValue('default_queue')->end()->end();
+        $rootNode->children()->enumNode('command_provider')->values([])->end()->arrayNode('provider_options')->scalarPrototype()->end()->end()->scalarNode('queue_name')->defaultValue('default_queue')->end()->end();
         return $treeBuilder;
     }
 }

15) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/DependencyInjection/ConsoleUiExtension.php:15    [M] PublicVisibility

--- Original
+++ New
@@ @@
 class ConsoleUiExtension extends ConfigurableExtension
 {
     /** @param array<mixed> $mergedConfig */
-    public function loadInternal(array $mergedConfig, ContainerBuilder $container) : void
+    protected function loadInternal(array $mergedConfig, ContainerBuilder $container) : void
     {
     }
 }

16) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:31    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
     {
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
-        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
+        
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
         $process->setPty(true);
         try {

17) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:33    [M] IncrementInteger

--- Original
+++ New
@@ @@
     {
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
-        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
+        $this->hub->publish(new Update('http://example.com/' . $command[1], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
         $process->setPty(true);
         try {

18) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:33    [M] Concat

--- Original
+++ New
@@ @@
     {
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
-        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
+        $this->hub->publish(new Update($command[0] . 'http://example.com/', $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
         $process->setPty(true);
         try {

19) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:33    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
-        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
+        $this->hub->publish(new Update($command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
         $process->setPty(true);
         try {

20) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:33    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
-        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
+        $this->hub->publish(new Update('http://example.com/', $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
         $process->setPty(true);
         try {

21) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:34    [M] Concat

--- Original
+++ New
@@ @@
     {
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
-        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
+        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', $commandline . 'bin/console ' . PHP_EOL)));
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
         $process->setPty(true);
         try {

22) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:34    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
-        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
+        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', $commandline . PHP_EOL)));
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
         $process->setPty(true);
         try {

23) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:34    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
-        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
+        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . PHP_EOL)));
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
         $process->setPty(true);
         try {

24) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:34    [M] Concat

--- Original
+++ New
@@ @@
     {
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
-        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
+        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . PHP_EOL . $commandline)));
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
         $process->setPty(true);
         try {

25) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:34    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
     {
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
-        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
+        $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline)));
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
         $process->setPty(true);
         try {

26) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:37    [M] SpreadOneItem

--- Original
+++ New
@@ @@
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
         $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
-        $process = new Process(['./bin/console', ...$command], $this->projectDir);
+        $process = new Process(['./bin/console', [...$command][0]], $this->projectDir);
         $process->setPty(true);
         try {
             $process->start();

27) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:37    [M] SpreadRemoval

--- Original
+++ New
@@ @@
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
         $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
-        $process = new Process(['./bin/console', ...$command], $this->projectDir);
+        $process = new Process(['./bin/console', $command], $this->projectDir);
         $process->setPty(true);
         try {
             $process->start();

28) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:37    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
         $commandline = $message->getBody();
         $command = explode(' ', $commandline);
         $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
-        $process = new Process(['./bin/console', ...$command], $this->projectDir);
+        $process = new Process([...$command], $this->projectDir);
         $process->setPty(true);
         try {
             $process->start();

29) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:38    [M] TrueValue

--- Original
+++ New
@@ @@
         $command = explode(' ', $commandline);
         $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
-        $process->setPty(true);
+        $process->setPty(false);
         try {
             $process->start();
             while ($process->isRunning()) {

30) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:38    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $command = explode(' ', $commandline);
         $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('STOPPED', 'bin/console ' . $commandline . PHP_EOL)));
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
-        $process->setPty(true);
+        
         try {
             $process->start();
             while ($process->isRunning()) {

31) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:41    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         $process = new Process(['./bin/console', ...$command], $this->projectDir);
         $process->setPty(true);
         try {
-            $process->start();
+            
             while ($process->isRunning()) {
                 $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             }

32) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:42    [M] While_

--- Original
+++ New
@@ @@
         $process->setPty(true);
         try {
             $process->start();
-            while ($process->isRunning()) {
+            while (false) {
                 $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             }
             if (!$process->isSuccessful()) {

33) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:43    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
         try {
             $process->start();
             while ($process->isRunning()) {
-                $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
+                
             }
             if (!$process->isSuccessful()) {
                 throw new ProcessFailedException($process);

34) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:45    [M] IncrementInteger

--- Original
+++ New
@@ @@
         try {
             $process->start();
             while ($process->isRunning()) {
-                $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
+                $this->hub->publish(new Update('http://example.com/' . $command[1], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             }
             if (!$process->isSuccessful()) {
                 throw new ProcessFailedException($process);

35) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:45    [M] Concat

--- Original
+++ New
@@ @@
         try {
             $process->start();
             while ($process->isRunning()) {
-                $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
+                $this->hub->publish(new Update($command[0] . 'http://example.com/', $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             }
             if (!$process->isSuccessful()) {
                 throw new ProcessFailedException($process);

36) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:45    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         try {
             $process->start();
             while ($process->isRunning()) {
-                $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
+                $this->hub->publish(new Update($command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             }
             if (!$process->isSuccessful()) {
                 throw new ProcessFailedException($process);

37) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:45    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
         try {
             $process->start();
             while ($process->isRunning()) {
-                $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
+                $this->hub->publish(new Update('http://example.com/', $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             }
             if (!$process->isSuccessful()) {
                 throw new ProcessFailedException($process);

38) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:51    [M] LogicalNot

--- Original
+++ New
@@ @@
             while ($process->isRunning()) {
                 $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             }
-            if (!$process->isSuccessful()) {
+            if ($process->isSuccessful()) {
                 throw new ProcessFailedException($process);
             }
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));

39) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:52    [M] Throw_

--- Original
+++ New
@@ @@
                 $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             }
             if (!$process->isSuccessful()) {
-                throw new ProcessFailedException($process);
+                new ProcessFailedException($process);
             }
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));

40) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:54    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             if (!$process->isSuccessful()) {
                 throw new ProcessFailedException($process);
             }
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
+            
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {

41) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:56    [M] IncrementInteger

--- Original
+++ New
@@ @@
             if (!$process->isSuccessful()) {
                 throw new ProcessFailedException($process);
             }
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
+            $this->hub->publish(new Update('http://example.com/' . $command[1], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {

42) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:56    [M] Concat

--- Original
+++ New
@@ @@
             if (!$process->isSuccessful()) {
                 throw new ProcessFailedException($process);
             }
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
+            $this->hub->publish(new Update($command[0] . 'http://example.com/', $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {

43) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:56    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!$process->isSuccessful()) {
                 throw new ProcessFailedException($process);
             }
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
+            $this->hub->publish(new Update($command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {

44) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:56    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             if (!$process->isSuccessful()) {
                 throw new ProcessFailedException($process);
             }
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
+            $this->hub->publish(new Update('http://example.com/', $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {

45) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:61    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
                 throw new ProcessFailedException($process);
             }
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
+            
             return Result::ACK;
         } catch (ProcessFailedException $e) {
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('FAILED', $process->getErrorOutput())));

46) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:63    [M] IncrementInteger

--- Original
+++ New
@@ @@
                 throw new ProcessFailedException($process);
             }
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
+            $this->hub->publish(new Update('http://example.com/' . $command[1], $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('FAILED', $process->getErrorOutput())));

47) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:63    [M] Concat

--- Original
+++ New
@@ @@
                 throw new ProcessFailedException($process);
             }
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
+            $this->hub->publish(new Update($command[0] . 'http://example.com/', $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('FAILED', $process->getErrorOutput())));

48) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:63    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 throw new ProcessFailedException($process);
             }
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
+            $this->hub->publish(new Update($command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('FAILED', $process->getErrorOutput())));

49) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:63    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
                 throw new ProcessFailedException($process);
             }
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('RUNNING', $process->getIncrementalOutput())));
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
+            $this->hub->publish(new Update('http://example.com/', $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('FAILED', $process->getErrorOutput())));
