50) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:70    [M] MethodCallRemoval

--- Original
+++ New
@@ @@
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('FAILED', $process->getErrorOutput())));
+            
             return Result::reject(sprintf('The process failed with exception: "%s" in %s at %s', $e->getMessage(), $e->getFile(), $e->getLine()));
         }
     }

51) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:72    [M] IncrementInteger

--- Original
+++ New
@@ @@
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('FAILED', $process->getErrorOutput())));
+            $this->hub->publish(new Update('http://example.com/' . $command[1], $this->parseMessage('FAILED', $process->getErrorOutput())));
             return Result::reject(sprintf('The process failed with exception: "%s" in %s at %s', $e->getMessage(), $e->getFile(), $e->getLine()));
         }
     }

52) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:72    [M] Concat

--- Original
+++ New
@@ @@
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('FAILED', $process->getErrorOutput())));
+            $this->hub->publish(new Update($command[0] . 'http://example.com/', $this->parseMessage('FAILED', $process->getErrorOutput())));
             return Result::reject(sprintf('The process failed with exception: "%s" in %s at %s', $e->getMessage(), $e->getFile(), $e->getLine()));
         }
     }

53) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:72    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('FAILED', $process->getErrorOutput())));
+            $this->hub->publish(new Update($command[0], $this->parseMessage('FAILED', $process->getErrorOutput())));
             return Result::reject(sprintf('The process failed with exception: "%s" in %s at %s', $e->getMessage(), $e->getFile(), $e->getLine()));
         }
     }

54) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:72    [M] ConcatOperandRemoval

--- Original
+++ New
@@ @@
             $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('SUCCEED', $process->getStatus())));
             return Result::ACK;
         } catch (ProcessFailedException $e) {
-            $this->hub->publish(new Update('http://example.com/' . $command[0], $this->parseMessage('FAILED', $process->getErrorOutput())));
+            $this->hub->publish(new Update('http://example.com/', $this->parseMessage('FAILED', $process->getErrorOutput())));
             return Result::reject(sprintf('The process failed with exception: "%s" in %s at %s', $e->getMessage(), $e->getFile(), $e->getLine()));
         }
     }

55) /home/kpicaza/server/console-ui/sommelier-crawler/packages/console-ui-bundle/src/Queue/RunCommandProcessor.php:88    [M] ArrayItemRemoval

--- Original
+++ New
@@ @@
     }
     private function parseMessage(string $commandStatus, string $content) : string
     {
-        return json_encode(['status' => $commandStatus, 'content' => $content], JSON_THROW_ON_ERROR);
+        return json_encode(['content' => $content], JSON_THROW_ON_ERROR);
     }
     public static function getSubscribedCommand() : string
     {
